---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.ContainerType
source: html/deb14265-7245-94f3-dd1e-7a800ec19f53.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.ContainerType Property

Reports whether this is a simple field containing one value,
 or a container of multiple values.

## Syntax (C#)
```csharp
public ContainerType ContainerType { get; }
```